cask_args appdir: '/Applications'

#tap 'homebrew/cask-cask'
#tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

tap 'atombender/ktail'
tap 'candid82/brew'
tap 'ktr0731/evans'

brew 'ack'
brew 'atombender/ktail/ktail'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bazel'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'candid82/brew/joker'
brew 'clojure'
brew 'coreutils'
brew 'ctags'
brew 'direnv'
brew 'evans'
brew 'fzf' # fuzzy-finder https://github.com/junegunn/fzf
brew 'git'
brew 'git-lfs'
brew 'graphviz'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'go'
brew 'grc'
brew 'hadolint'
brew 'java'
brew 'java11'
brew 'jenv'
brew 'jq'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'leiningen'
brew 'maven'
brew 'mycli'
brew 'neovim'
brew 'nmap'
brew 'openssl'
brew 'packer'
brew 'parallel'
brew 'planck'
brew 'pyenv'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'ruby-build'
brew 'shellcheck'
brew 'sops'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'wget'

#cask 'atom'
#cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitter'
#cask 'google-chrome'
cask 'google-cloud-sdk'
#cask 'graphql-playground'
cask 'hammerspoon'
#cask 'haskell-platform'
cask 'iterm2'
cask 'java'
cask 'joplin'
cask 'homebrew/cask-versions/adoptopenjdk8'
cask 'keybase'
cask 'macdown'
cask 'macvim'
#cask 'minikube'
#cask 'postico'
#cask 'skitch'
#cask 'slack'
cask 'spotify'
cask 'vagrant'
cask 'vlc'
#cask 'vmware-fusion'
cask 'yourkit-java-profiler'
cask 'wireshark'
