cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'coreutils'
brew 'ctags'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'go'
brew 'grc'
brew 'kubernetes-cli'
brew 'leiningen'
brew 'mycli'
brew 'neovim'
brew 'nmap'
brew 'openssl'
brew 'packer'
brew 'parallel'
brew 'planck'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'rlwrap'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'wget'

cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'keybase'
cask 'google-chrome'
cask 'gitter'
cask 'haskell-platform'
cask 'iterm2'
cask 'java8'
cask 'macdown'
cask 'macvim'
cask 'minikube'
cask 'postico'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
