cask_args appdir: '/Applications'

#tap 'homebrew/cask-cask'
#tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

tap 'atombender/ktail'
tap 'candid82/brew'

brew 'ack'
brew 'atombender/ktail/ktail'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bazel'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'candid82/brew/joker'
brew 'clojure'
brew 'coreutils'
brew 'ctags'
brew 'fzf' # fuzzy-finder https://github.com/junegunn/fzf
brew 'git'
brew 'git-lfs'
brew 'graphviz'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'go'
brew 'grc'
brew 'hadolint'
brew 'joplin'
brew 'jq'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx'
brew 'leiningen'
brew 'maven'
brew 'mycli'
brew 'neovim'
brew 'nmap'
brew 'openssl'
brew 'packer'
brew 'parallel'
brew 'planck'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'rlwrap'
brew 'shellcheck'
brew 'sops'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unrar'
brew 'wget'
brew 'yarn', args: ['--without-node']

cask 'atom'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gitter'
cask 'google-chrome'
cask 'graphql-playground'
cask 'haskell-platform'
cask 'iterm2'
cask 'java8'
cask 'keybase'
cask 'macdown'
cask 'macvim'
cask 'minikube'
cask 'postico'
cask 'skitch'
cask 'slack'
cask 'spotify'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
